//=============================================================================
//
// レーンヘッダー処理 [lane.h]
// Author : GP12A332_25_染矢晃介
//
//=============================================================================
#ifndef _LANE_H_
#define _LANE_H_

#include "main.h"

struct LANE
{
	D3DXVECTOR3			pos;				// レーンの位置
	D3DXVECTOR3			scl;				// レーンの大きさ(スケール)
	bool				use;				// レーンの使用状態
	D3DXMATRIX			mtxWorld;			// ワールドマトリックス

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitLane(void);
void UninitLane(void);
void UpdateLane(void);
void DrawLane(void);

#endif

