//=============================================================================
//
// ノーツヘッダー処理 [notes.h]
// Author : 
//
//=============================================================================
#ifndef _NOTES_H_
#define _NOTES_H_

#include "main.h"

enum LANE_NUM
{//レーン通し番号
	LEFT_LANE,
	CENTER_LANE,
	RIGHT_LANE,
	LANE_MAX
};

struct NOTES
{
	D3DXVECTOR3			pos;				// ノーツの位置
	D3DXVECTOR3			rot;				// ノーツの向き(回転)
	D3DXVECTOR3			scl;				// ノーツの大きさ(スケール)
	bool				use;				// ノーツの使用状態
	D3DXMATRIX			mtxWorld;			// ワールドマトリックス
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitNotes(void);
void UninitNotes(void);
void UpdateNotes(void);
void DrawNotes(void);

//=============================================================================
// ノーツの設置関数
// 第１引数：int lineNum(判定するレーン番号)
// 戻り値　：な　し
//=============================================================================
void SetNotes(int laneNum);			

//=============================================================================
// ノーツの当たり判定関数
// 第１引数：int lineNum(判定するレーン番号)
// 戻り値　：な　し
//=============================================================================
void CheckHitNotes(int laneNum);	// ノーツのタイミング判定関数

#endif
